const declensionOfNouns = (word, declension) => {
    const endings = [
        ['езд', 'езда', 'езду', 'езд', 'ездом', 'езде'],
        ['еец', 'ейца', 'ейцу', 'ейца', 'ейцом', 'ейце'],
        ['ец', 'ца', 'цу', 'ца', 'цом', 'це'],
        ['яц', 'йца', 'йцу', 'яц', 'йцом', 'це'],
        ['зь', 'зя', 'зю', 'зя', 'зем', 'зе'],
        ['ев', 'ева', 'еву', 'ев', 'евом', 'еве'],
        ['ия', 'ии', 'ии', 'ию', 'ией', 'ии'],
        ['ма', 'мы', 'ме', 'му', 'мой', 'ме'],
        ['рь', 'ря', 'рю', 'ря', 'рем', 'ре'],
        ['ть', 'тери', 'тери', 'ть', 'терью', 'тери'],
        ['а', 'ы', 'е', 'у', 'ой', 'е'],
        ['я', 'и', 'и', 'ю', 'ей', 'и'],
        ['е', 'я', 'ю', 'е', 'ем', 'и'],
        ['о', 'а', 'у', 'о', 'ом', 'е'],
        ['м', 'ма', 'му', 'м', 'мом', 'ме'],
        ['', 'а', 'у', '', 'ом', 'е'],
    ]

    for (let i = 0; i < endings.length; i++) {
        if (!word.endsWith(endings[i][0])) continue;
        const regexp = new RegExp(endings[i][0] + '$')
        return word.replace(regexp, endings[i][declension - 1])
    }
    return 'Error'
}

export default declensionOfNouns;
